arnoutzw/esp32-rover/sdkconfig.defaults.ttgo
# TTGO T-Display Rover SDK Configuration
# Use this configuration for TTGO T-Display module (no camera)

# Target ESP32
CONFIG_IDF_TARGET="esp32"

# Flash size (4MB for TTGO T-Display)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM support - disabled for TTGO T-Display (no PSRAM)
# CONFIG_ESP32_SPIRAM_SUPPORT is not set

# Camera support - disabled for TTGO T-Display
# CONFIG_CAMERA_CORE0 is not set

# WiFi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# LWIP
CONFIG_LWIP_MAX_SOCKETS=16

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Disable WiFi NVS to prevent mode override issues
CONFIG_ESP_WIFI_NVS_ENABLED=n
